init.org
#+Title: Emacs literate configuration
#+Author: Błażej Nowiński
#+Description: A configuration for writing academic notes and more.
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+Startup: showeverything
#+Options: toc:2

* Table Of Contents :toc:
- [[#resources][Resources]]
  - [[#manual][Manual]]
  - [[#books][Books]]
- [[#core-setup--performance][Core Setup & Performance]]
  - [[#startup][Startup]]
  - [[#package-manager][Package manager]]
  - [[#emacs-settings][Emacs settings]]
  - [[#custom-functions--global-keybindings][Custom functions & Global keybindings]]
- [[#appearance][Appearance]]
  - [[#theme][Theme]]
  - [[#doom-modeline][Doom Modeline]]
  - [[#nerd-icons][Nerd Icons]]
- [[#core-packages][Core packages]]
  - [[#navigation-avy--ace-link--ace-window][Navigation (avy + ace-link + ace-window)]]
  - [[#better-help-helpful--which-key][Better Help (Helpful + Which-key)]]
  - [[#minibuffer-vertico--marginalia][Minibuffer (Vertico + Marginalia)]]
  - [[#completion-corfu--cape--orderless][Completion (Corfu + Cape + Orderless)]]
  - [[#eat-emulate-a-terminal][Eat (Emulate A Terminal)]]
  - [[#version-control-magit--diff-hl][Version Control (Magit + Diff-hl)]]
  - [[#miscellaneous-undos-todos--generally-prettify][Miscellaneous (undos todos & generally prettify)]]
  - [[#consult][Consult]]
- [[#file-management--opening][File management & opening]]
  - [[#dired][Dired]]
  - [[#viewing-files--externally][Viewing files (& externally)]]
- [[#writing][Writing]]
  - [[#org-mode][Org Mode]]
  - [[#text-mode][text mode]]
  - [[#emacs-writing-studio-variables-autoload--executables-check][Emacs writing studio variables autoload & executables check]]
  - [[#notetaking-org--denote--consult][Notetaking (org + denote + consult)]]
  - [[#bibliography][Bibliography]]
  - [[#spell-check-sideline-flymake][Spell check (Sideline-flymake)]]
  - [[#export][Export]]
- [[#trying-out---packages][Trying out - packages]]
  - [[#embark][Embark]]
- [[#coding][Coding]]
  - [[#projectile][Projectile]]
  - [[#lsp-eglot--mason][LSP (Eglot + Mason)]]
  - [[#tree-sitter][Tree-Sitter]]
  - [[#snippets-yasnippet--snippy][Snippets (Yasnippet + Snippy)]]

* Resources
It is *recommended* to configure it from the *init.org* file.
Kickstart.emacs is a starting point for your own configuration.
MiniApollo

First I recommend starting with the Emacs tutorial with the following
keybinding: C-h t Or running the command with M-x: help-with-tutorial

Test ./

** Manual
Everything under C-h is used for help keybindings.

Using the following keybind: C-h C-h Or running the following command
M-x: help-for-help

The most used commands for me are:
- C-h v Describe variable
- C-h f Describe function
- C-h k Describe key

Other also really useful ones:
- C-h i Show all installed manuals
- C-h r Emacs manual
- C-h a Search for commands (see also M-x: Apropos)
- C-h m Show help for current major and minor modes

For more about info-mode: C-h f: info-mode

Basic navigation:
- d key: Go back to the top-level Info Directory.
- u key: Go up to the parent node in the document's hierarchy.
- n key: for next node in the current manual.
- p key: for previous node in the current manual.

*Note:* A Node is essentially a specific section or topic, much like a
chapter or subsection in a book.

When you are browsing through the Emacs manual you can easily search
with:
- i key: for specific subjects in the current manual.
- g key: for nodes (sections).
- m key: for menu items within the current Info buffer.
- s key: for regular expression patterns (like words) within the
  current Info buffer.

Using goto-node:
- Specify a Manual: If you want to search within a particular manual,
  place its name in parentheses like (emacs).
- After that tell where you want to go in that manual. For example
  (emacs)Top, (emacs)specific section.
- If you don't type a manual name, goto-node will search the currently
  opened manual.

** Books
basic lisp
https://learnxinyminutes.com/elisp/
advanced lisp
https://www.gnu.org/software/emacs/manual/html_node/eintr/

* Core Setup & Performance
These are essential settings and small tweaks that must load before
any packages. They impact the entire configuration, skipping these
could result in significantly slower configuration and potential
breakage of your setup.

** Startup
Gotta go fast.

*** Startup Performance
Core performance tweaks moved to early-init.el
See: [[https://github.com/doomemacs/doomemacs/issues/310][Why is doom emacs so fast?]]

*** Lexical-bindings
Gives better performance, lexical closures, and code safety, allowing
local variables to remain truly local.
#+begin_src emacs-lisp
    ;; -*- lexical-binding: t; -*-
#+end_src

*** Early-Init.el
This file is loaded before anything else. Most of the performance
tweaks are there. We can configure things before the GUI or other
packages are loaded.

*** Auto-tangle Configuration file
Auto-Tangle Org configuration file for better startup times, it
refreshes the package-quickstart file. We'll cover package quickstart
in the package manager section later.

If you like to auto tangle an Org file, don't forget to add the
following line to the top of your Org document: (#+PROPERTY:
header-args:emacs-lisp :tangle ./init.el :mkdirp yes)

*Remember*, if this code can't be loaded (errors before this code), the
init.el file won't update on change! To fix this, you need to find
this file (C-x C-f), fix the error and press C-c C-v t to tangle it
manually.

This snippet adds a hook to org-mode buffers so that
start/org-babel-tangle-config gets executed each time such a buffer
gets saved. This function checks to see if the file being saved is the
init.org file you’re looking at right now, and if so, automatically
exports the configuration here to the associated output files.
#+begin_src emacs-lisp
    (defun baej/org-babel-tangle-config ()
      "Automatically tangle our init.org config file and refresh package-quickstart when we save it. Credit to Emacs From Scratch for this one!"
      (interactive)
      (when (string-equal (file-name-directory (buffer-file-name))
                          (expand-file-name user-emacs-directory))
        ;; Dynamic scoping to the rescue
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle)
          (package-quickstart-refresh)
          )))

    (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'baej/org-babel-tangle-config)))
#+end_src

*** Show startup time
#+begin_src emacs-lisp
    (defun start/display-startup-time ()
      (interactive)
      (message "Emacs loaded in %s with %d garbage collections."
               (format "%.2f seconds"
                       (float-time
                        (time-subtract after-init-time before-init-time)))
               gcs-done))

    (add-hook 'emacs-startup-hook #'start/display-startup-time)
#+end_src

*** (optional) Multi File Example
**** Adding the lisp directory to load-path
Adds the lisp directory to Emacs's load path to search for elisp files.
This is necessary because Emacs does not search the entire user-emacs-directory.
The directory name can be anything, just add it to the load-path.
#+begin_src emacs-lisp
    ;; (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
#+end_src

**** Using the file
And now we can use everything from that file.
#+begin_src emacs-lisp
    ;; (start/hello)
#+end_src

**** Sourcing the files
To use the elisp files we need to load it.
Notes:
- Don't forget the file and the provide name needs to be the same.
- When naming elisp files, functions, it is recommended to use a group name (e.g. init-, start- or any custom name), so it does not get mixed up with other names, functions.
#+begin_src emacs-lisp
    ;; (require 'start-multiFileExample)
#+end_src

*** Startup timer
Esup (Emacs Start Up Profiler)
Benchmark Emacs Startup time: M-x esup

#+begin_src emacs-lisp
    (use-package esup
      :defer
      :custom
      (esup-depth 0))
#+end_src

** Package manager
We use the default built in package manager package.el.

Alternative package managers (straight.el, elpaca, etc.) are useful if
you want:
- Faster package installation.
- Lock file support for recovery if something goes wrong.
- Packages that are cloned as Git (or other) repositories, not as
  opaque tarballs.
- Better UI
- Async support

If you are interested in using other package managers, check out their
git repositories.  To learn more about why something like [[https://github.com/doomemacs/doomemacs/blob/master/docs/faq.org#why-does-doom-use-straightel-and-not-packageel][doomemacs
uses]] straight.el not package.el.

In my experience Package.el is not slow and gets the job done.

To update/upgrade packages, use the package-upgrade-all command.
Package.el has a UI. Check it out with M-x list-packages.

*** Use-package
A macro that allows you to isolate package configuration in your
.emacs file in a way that is both performance-oriented and, well,
tidy.  We use it because it makes package configuration really easy.

With Emacs 29 use-package is now built-in.

This code eliminates the need to type :ensure t for each package
download.  Instead, you'll only need to use :ensure nil when you want
to explicitly prevent a package from being downloaded.
#+begin_src emacs-lisp
  (use-package use-package
    :custom
    (use-package-always-ensure t)
    (package-native-compile t)
    (warning-minimum-level :emergency))
#+end_src

**** Most used parts of use-package
Here is some notes on what each use-package keyword does.
For more check out the use-package documentation to see how powerful it is:
C-h i: g for goto-node: Type (use-package)Top

This code block is not tangled, it is just an example.
#+begin_src emacs-lisp :tangle no
  ;; Configure the 'foo' package
  ;; You can also use (use-package emacs) to customize Emacs with use-package.
  (use-package foo
    :init (message "Before")    ;; execute code Before a package is loaded.
    :config (message "After")   ;; execute code After a package is loaded.
    :custom (foovar t)          ;; Customization of package custom variables same as setq.
    :ensure t                   ;; Ensure the package is installed if it's not already.

    ;; These are also used for lazy loading.
    ;; Don't load the package until these are not true.
    :bind ("C-." . myfunc)      ;; Defer package loading until keybindings are invoked.
    :after (mypackage)          ;; Load package after specified packages have been loaded.
    ;; If you don't know what a hook is:
    ;; C-h i: g for goto-node: Type (emacs)Hooks
    :hook (myhook . myfunc)     ;; Add functions to specified hooks when the package is loaded.

    :command (bar)              ;; Define commands provided by the package to be lazy-loaded.
    :defer t                    ;; Only load this package if it's explicitly needed or a command/hook associated with it is called.
    ;; Install package with package.el from source.
    :vc (:url "<You git repo url>"
              :branch "main"
              :rev :newest) ;; Use latest commit
    )
#+end_src

*** Setting package repositories
Like Linux distributions, Emacs uses repositories to manage its packages.
#+begin_src emacs-lisp
  (setq package-archives '(("melpa" . "https://melpa.org/packages/") ;; Sets default package repositories
                           ("elpa" . "https://elpa.gnu.org/packages/")
                           ("nongnu" . "https://elpa.nongnu.org/nongnu/"))) ;; For Eat Terminal
#+end_src

*** Package quickstart
Improves startup times by allowing Emacs to precompute and generate a
single, large autoload file.  Instead of re-computing them on every
startup.

The larger your configuration, the more it will be felt at startup.

However, if you enable this, you'll need to manually run the
package-quickstart-refresh command whenever your package activations
change, such as when you modify the package-load-list value.  We put
it inside Auto-tangle hook so when we save this file it runs it
automatically.

As I tested, it makes startup about 0.1 seconds faster.  Avg:
- Off: 0.66 sec
- On: 0.59 sec

Package quickstart only works with package.el.  If you plan to use a
different package manager, remember to remove this section and the
package-quickstart-refresh line in the Auto-tangle hook.
#+begin_src emacs-lisp
  (setq package-quickstart t) ;; For blazingly fast startup times, this line makes startup miles faster
#+end_src

*** Package Async
Simple library for asynchronous processing in Emacs.
Makes package installation about 30 sec faster.
Only works with package.el.
#+begin_src emacs-lisp
  (use-package async
    :defer
    :custom
    (dired-async-mode t)
    (async-bytecomp-package-mode t)
    (async-bytecomp-allowed-packages '(all))
    (async-package-do-action t))
#+end_src

