init.org
** Emacs settings
#+begin_src emacs-lisp
  (use-package emacs
    :custom
    ;; Still needed for terminals
    (menu-bar-mode nil)         ;; Disable the menu bar
    (scroll-bar-mode nil)       ;; Disable the scroll bar
    (tool-bar-mode nil)         ;; Disable the tool bar

    (inhibit-startup-screen t)  ;; Disable welcome screen
    (initial-major-mode 'org-mode)        ;; Scratch buffer org mode
    (setq initial-scratch-message (concat ""))

    (delete-selection-mode t)   ;; Select text and delete it by typing.
    (electric-indent-mode nil)  ;; Turn off the weird indenting that
                                ;; Emacs does by default.
    (electric-pair-mode t)      ;; Turns on automatic parens pairing

    (blink-cursor-mode nil)     ;; Don't blink cursor
    (global-auto-revert-mode t) ;; Automatically reload file and show changes if the file has changed
    (use-short-answers t)   ;; Since Emacs 29, `yes-or-no-p' will use 'y-or-n-p'

    ;;(dired-kill-when-opening-new-dired-buffer t) ;; Dired don't create new buffer
    ;;(recentf-mode t) ;; Enable recent file mode
    (when (display-graphic-p)(context-menu-mode t)) ;; Right-click menu

    (global-visual-line-mode t)           ;; Enable line wrapping (NOTE: breaks vundo)

    ;;(global-display-line-numbers-mode t)  ;; Display line numbers
    ;;(display-line-numbers-type 'relative) ;; Relative line numbers
    (global-hl-line-mode t)               ;; Highlight current line
    (fill-column 70)

    (native-comp-async-report-warnings-errors 'silent) ;; Don't show native comp errors
    (warning-minimum-level :error) ;; Only show errors in warnings buffer

    (mouse-wheel-progressive-speed nil) ;; Disable progressive speed when scrolling
    (scroll-conservatively 10) ;; Smooth scrolling
    ;; (scroll-margin 8)

    ;; (pixel-scroll-precision-mode t) ;; Precise pixel scrolling. i.e. smooth scrolling (GUI only)
    ;; (pixel-scroll-precision-use-momentum nil)

    (indent-tabs-mode nil) ;; Only use spaces for indentation
    (tab-width 2)
    (sgml-basic-offset 4) ;; Set Html mode indentation to 4
    (c-ts-mode-indent-offset 4) ;; Fix weird indentation in c-ts (C, C++)
    (go-ts-mode-indent-offset 4) ;; Fix weird indentation in go-ts

    ;; (display-fill-column-indicator-column 80) ;; Set line length indicator to 80 characters
    (whitespace-style '(face tabs tab-mark trailing))
    (winner-mode 1)

    (make-backup-files nil) ;; Stop creating ~ backup files
    (auto-save-default nil) ;; Stop creating # auto save files
    (delete-by-moving-to-trash t)
    :hook
    (prog-mode . hs-minor-mode) ;; Enable folding hide/show globally
    ;; (prog-mode . display-fill-column-indicator-mode) ;; Display line length indicator
    (prog-mode . whitespace-mode)
    (text-mode . auto-fill-mode)
    :config
    ;; Move customization variables to a separate file and load it, avoid filling up init.el with unnecessary variables
    (setq custom-file (locate-user-emacs-file "custom-vars.el"))
    (load custom-file 'noerror 'nomessage)
    :bind (
           ([escape] . keyboard-escape-quit) ;; Makes Escape quit prompts (Minibuffer Escape)
           ;; Zooming In/Out
           ("C-+" . text-scale-increase)
           ("C--" . text-scale-decrease)
           ("<C-wheel-up>" . text-scale-increase)
           ("<C-wheel-down>" . text-scale-decrease)
           ))
#+end_src

#+RESULTS:
: text-scale-decrease

** Custom functions & Global keybindings
If you want to use the built in methods I recommend using these ones:

This code block is not tangled, it is just an example.
#+begin_src emacs-lisp :tangle no
    (define-key KEYMAP KEY DEF)
    (global-set-key KEY COMMAND)
    (use-package :bind (  ))
#+end_src
To read more about using the built in methods, check out this awesome article from [[https://www.masteringemacs.org/article/mastering-key-bindings-emacs][masteringemacs]].

*** Half-page jumps
Vim-inspired half-page jumps with centering.
#+begin_src emacs-lisp
  (defun baej-scroll-half-page-down-and-center ()
    (interactive)
    (vertical-motion (/ (window-body-height) 2))
    (recenter))

  (defun baej-scroll-half-page-up-and-center ()
    (interactive)
    (vertical-motion (- (/ (window-body-height) 2)))
    (recenter))

  (defun baej-consult-ripgrep-docs ()
         (interactive)
         (require 'consult)
         (consult-ripgrep "/home/baej/docs"))

  (defun baej-consult-fd-docs ()
         (interactive)
         (require 'consult)
         (consult-fd "/home/baej/docs"))

  (global-set-key (kbd "C-v") #'baej-scroll-half-page-down-and-center)
  (global-set-key (kbd "M-v") #'baej-scroll-half-page-up-and-center)
#+end_src

*** Open literate org config
For convenience cuz its wip.
#+begin_src emacs-lisp
(defun baej-open-init-file ()
  "Open init.org configuration file"
  (interactive)
  (find-file "~/.config/emacs/init.org"))

(global-set-key (kbd "C-c i") 'baej-open-init-file)
#+end_src

*** Reload init.el file
#+begin_src emacs-lisp
(defun baej-reload-config ()
  "Reload init.el configuration file"
  (interactive)
  (load-file "~/.config/emacs/init.el"))
(global-set-key (kbd "C-c r") 'baej-reload-config)
#+end_src

*** Customising viariables
#+begin_src emacs-lisp
  (keymap-global-set "C-c w v" 'customize-variable)
  (setq-default custom-file (expand-file-name
  			     "custom.el"
  			     user-emacs-directory))
  (load custom-file :no-error-if-file-is-missing)
#+end_src

* Appearance
Set fonts in the early-init.el file
** Theme
*** Set Theme
Normal way of doing this.
Set gruvbox theme, if you want some themes try out doom-themes.
Use consult-theme to easily try out themes (*Epilepsy* Warning).
#+begin_src emacs-lisp :tangle no
    (use-package gruvbox-theme
      :config
      (setq gruvbox-bold-constructs t)
      (load-theme 'gruvbox-dark-hard t)) ;; We need to add t to trust this package
#+end_src
*** Darkman & Gruvbox (Auto-Theme)
Integration with system service: darkman, with darkman.el package.
It loads the gruvbox theme but doesn't set it.
Darkman is responsible for reading DBUS and sets the theme according to
system configuration.
#+begin_src emacs-lisp
    (use-package gruvbox-theme
      :config
      (setq gruvbox-bold-constructs t))
    (use-package darkman
      :after gruvbox-theme
      :config
      (setq darkman-themes '(:light gruvbox-light-hard :dark gruvbox-dark-hard))
      (defadvice darkman-set (before no-theme-stacking activate)
        "Disable the previous theme before loading a new one."
        (mapc #'disable-theme custom-enabled-themes))
      (if (daemonp)
          (progn
            (add-hook 'server-after-make-frame-hook #'darkman-mode)
            (advice-add 'darkman-mode
                        :after
                        (lambda ()
                          (remove-hook 'server-after-make-frame-hook
                                       #'darkman-mode))))
        (darkman-mode 1)))
#+end_src
*** Transparency
With Emacs version 29, true transparency has been added.
#+begin_src emacs-lisp :tangle no
    (add-to-list 'default-frame-alist '(alpha-background . 90)) ;; For all new frames henceforth
    ;; Transparency in terminal
     (defun start/tui-enable-transparency ()
       (unless (display-graphic-p (selected-frame))
         (set-face-background 'default "unspecified-bg" (selected-frame))))
     (add-hook 'window-setup-hook 'start/tui-enable-transparency)
#+end_src

*** Spacious Padding
This package provides a global minor mode to increase the spacing/padding of Emacs windows and frames.
#+begin_src emacs-lisp
  ;; (use-package spacious-padding
  ;;   :custom
  ;;   (line-spacing 3)
  ;;   (spacious-padding-mode 1))
#+end_src

*** Centered text column (Olivetti)
Text centered reading and writing experience.
#+begin_src emacs-lisp
  (use-package olivetti
    :custom
    (olivetti-body-width 80)
    :hook
    (text-mode . olivetti-mode)
    (org-mode . olivetti-mode))
#+end_src

** Doom Modeline
A fancy, fast and customizable mode-line.
#+begin_src emacs-lisp
    (use-package doom-modeline
      :custom
      (doom-modeline-height 25) ;; Set modeline height
      :hook (after-init . doom-modeline-mode))
#+end_src

** Nerd Icons
This is an icon set that can be used with dired, ibuffer and other Emacs packages.
Don't forget nerd-icons-install-fonts to install the resource fonts.

We use nerd-icons because it supports both GUI and TUI unlike all-the-icons.
Also Doom modeline requires nerd icons.
#+begin_src emacs-lisp
    (use-package nerd-icons :defer)

    (use-package nerd-icons-dired
      :hook (dired-mode . nerd-icons-dired-mode))

    (use-package nerd-icons-ibuffer
      :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src
* Core packages
** Navigation (avy + ace-link + ace-window)
*** Avy
Line and to-word jumping with markers.
#+begin_src emacs-lisp
    (use-package avy
      :bind (
             ("M-j" . avy-goto-char-timer)
             ("M-k" . avy-goto-line)))
#+end_src
*** ace-link
Avy-based link jumping.
#+begin_src emacs-lisp
  (use-package ace-link
    :config
    (ace-link-setup-default)
    (global-set-key (kbd "M-O") 'ace-link-addr))
    (with-eval-after-load 'org
      (define-key org-mode-map (kbd "M-O") 'ace-link-org))
#+end_src
*** reboud other-window
#+begin_src emacs-lisp
  (global-set-key (kbd "M-o") 'other-window)
#+end_src

*** [unused] ace-window
#+begin_src emacs-lisp :tangle no
  (use-package ace-window
    :bind ("M-O" . ace-window)
    :custom
    (aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
#+end_src
** Better Help (Helpful + Which-key)
*** Helpful
An alternative to the built-in Emacs help that provides much more
contextual information.
#+begin_src emacs-lisp
    (use-package helpful
      :bind
      ;; Note that the built-in `describe-function' includes both functions
      ;; and macros. `helpful-function' is functions only, so we provide
      ;; `helpful-callable' as a drop-in replacement.
      ("C-h f" . helpful-callable)
      ("C-h v" . helpful-variable)
      ("C-h k" . helpful-key)
      ("C-h x" . helpful-command)
      )
#+end_src

