init.el
  ;; Still needed for terminals
  (menu-bar-mode nil)         ;; Disable the menu bar
  (scroll-bar-mode nil)       ;; Disable the scroll bar
  (tool-bar-mode nil)         ;; Disable the tool bar

  (inhibit-startup-screen t)  ;; Disable welcome screen
  (initial-major-mode 'org-mode)        ;; Scratch buffer org mode
  (setq initial-scratch-message (concat ""))

  (delete-selection-mode t)   ;; Select text and delete it by typing.
  (electric-indent-mode nil)  ;; Turn off the weird indenting that
                              ;; Emacs does by default.
  (electric-pair-mode t)      ;; Turns on automatic parens pairing

  (blink-cursor-mode nil)     ;; Don't blink cursor
  (global-auto-revert-mode t) ;; Automatically reload file and show
  ;; changes if the file has changed
  (use-short-answers t)   ;; Since Emacs 29, `yes-or-no-p' will use
  ;; `y-or-n-p'

  ;;(dired-kill-when-opening-new-dired-buffer t) ;; Dired don't create new buffer
  ;;(recentf-mode t) ;; Enable recent file mode
  (when (display-graphic-p)(context-menu-mode t)) ;; Right-click menu

  (global-visual-line-mode t)           ;; Enable line wrapping (NOTE: breaks vundo)
  ;;(global-display-line-numbers-mode t)  ;; Display line numbers
  ;;(display-line-numbers-type 'relative) ;; Relative line numbers
  (global-hl-line-mode t)               ;; Highlight current line

  (native-comp-async-report-warnings-errors 'silent) ;; Don't show native comp errors
  (warning-minimum-level :error) ;; Only show errors in warnings buffer

  (mouse-wheel-progressive-speed nil) ;; Disable progressive speed when scrolling
  (scroll-conservatively 10) ;; Smooth scrolling
  ;; (scroll-margin 8)

  ;; (pixel-scroll-precision-mode t) ;; Precise pixel scrolling. i.e. smooth scrolling (GUI only)
  ;; (pixel-scroll-precision-use-momentum nil)

  (indent-tabs-mode nil) ;; Only use spaces for indentation
  (tab-width 2)
  (sgml-basic-offset 4) ;; Set Html mode indentation to 4
  (c-ts-mode-indent-offset 4) ;; Fix weird indentation in c-ts (C, C++)
  (go-ts-mode-indent-offset 4) ;; Fix weird indentation in go-ts

  (display-fill-column-indicator-column 80) ;; Set line length indicator to 80 characters
  (whitespace-style '(face tabs tab-mark trailing))
  (winner-mode 1)

  (make-backup-files nil) ;; Stop creating ~ backup files
  (auto-save-default nil) ;; Stop creating # auto save files
  (delete-by-moving-to-trash t)
  :hook
  (prog-mode . hs-minor-mode) ;; Enable folding hide/show globally
  ;; (prog-mode . display-fill-column-indicator-mode) ;; Display line length indicator
  (prog-mode . whitespace-mode)
  :config
  ;; Move customization variables to a separate file and load it, avoid filling up init.el with unnecessary variables
  (setq custom-file (locate-user-emacs-file "custom-vars.el"))
  (load custom-file 'noerror 'nomessage)
  :bind (
         ([escape] . keyboard-escape-quit) ;; Makes Escape quit prompts (Minibuffer Escape)
         ;; Zooming In/Out
         ("C-+" . text-scale-increase)
         ("C--" . text-scale-decrease)
         ("<C-wheel-up>" . text-scale-increase)
         ("<C-wheel-down>" . text-scale-decrease)
         ))

(defun baej-scroll-half-page-down-and-center ()
  (interactive)
  (vertical-motion (/ (window-body-height) 2))
  (recenter))

(defun baej-scroll-half-page-up-and-center ()
  (interactive)
  (vertical-motion (- (/ (window-body-height) 2)))
  (recenter))

(global-set-key (kbd "C-v") #'baej-scroll-half-page-down-and-center)
(global-set-key (kbd "M-v") #'baej-scroll-half-page-up-and-center)

(defun baej/open-init-file ()
  "Open init.org configuration file"
  (interactive)
  (find-file "~/.config/emacs/init.org"))

(global-set-key (kbd "C-c i") 'baej/open-init-file)

(defun baej/reload-config ()
  "Reload init.el configuration file"
  (interactive)
  (load-file "~/.config/emacs/init.el"))
(global-set-key (kbd "C-c r") 'baej/reload-config)

(keymap-global-set "C-c w v" 'customize-variable)
(setq-default custom-file (expand-file-name
			     "custom.el"
			     user-emacs-directory))
(load custom-file :no-error-if-file-is-missing)

(use-package gruvbox-theme
  :config
  (setq gruvbox-bold-constructs t))
(use-package darkman
  :after gruvbox-theme
  :config
  (setq darkman-themes '(:light gruvbox-light-hard :dark gruvbox-dark-hard))
  (defadvice darkman-set (before no-theme-stacking activate)
    "Disable the previous theme before loading a new one."
    (mapc #'disable-theme custom-enabled-themes))
  (if (daemonp)
      (progn
        (add-hook 'server-after-make-frame-hook #'darkman-mode)
        (advice-add 'darkman-mode
                    :after
                    (lambda ()
                      (remove-hook 'server-after-make-frame-hook
                                   #'darkman-mode))))
    (darkman-mode 1)))

;; (use-package spacious-padding
;;   :custom
;;   (line-spacing 3)
;;   (spacious-padding-mode 1))

(use-package doom-modeline
  :custom
  (doom-modeline-height 25) ;; Set modeline height
  :hook (after-init . doom-modeline-mode))

(use-package nerd-icons :defer)

(use-package nerd-icons-dired
  :hook (dired-mode . nerd-icons-dired-mode))

(use-package nerd-icons-ibuffer
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))

(use-package avy
  :bind (
         ("M-j" . avy-goto-char-timer)
         ("M-k" . avy-goto-line)))

(use-package ace-link
  :config
  (ace-link-setup-default)
  (global-set-key (kbd "M-o") 'ace-link-addr))
  (with-eval-after-load 'org
    (define-key org-mode-map (kbd "M-o") 'ace-link-org))

(global-set-key (kbd "M-O") 'other-window)

(use-package helpful
  :bind
  ;; Note that the built-in `describe-function' includes both functions
  ;; and macros. `helpful-function' is functions only, so we provide
  ;; `helpful-callable' as a drop-in replacement.
  ("C-h f" . helpful-callable)
  ("C-h v" . helpful-variable)
  ("C-h k" . helpful-key)
  ("C-h x" . helpful-command)
  )
