init.org
*** Which-Key
Which-key is a helper utility for keychords (which key to press).
#+begin_src emacs-lisp
    (use-package which-key
      :ensure nil ;; Don't install which-key because it's now built-in
      :hook (after-init . which-key-mode)
      :diminish
      :custom
      (which-key-side-window-location 'bottom)
      (which-key-sort-order #'which-key-key-order-alpha) ;; Same as default, except single characters are sorted alphabetically
      (which-key-sort-uppercase-first nil)
      (which-key-add-column-padding 1) ;; Number of spaces to add to the left of each column
      (which-key-min-display-lines 6)  ;; Increase the minimum lines to display because the default is only 1
      (which-key-idle-delay 0.8)       ;; Set the time delay (in seconds) for the which-key popup to appear
      (which-key-max-description-length 25)
      (which-key-allow-imprecise-window-fit nil)) ;; Fixes which-key window slipping out in Emacs Daemon
#+end_src

** Minibuffer (Vertico + Marginalia)
- Vertico: Provides a performant and minimalistic vertical completion
  UI based on the default completion system.
- Savehist: Saves completion history.
- Marginalia: Adds extra metadata for completions in the margins (like
  descriptions).
- Nerd-icons-completion: Adds icons to completion candidates using the
  built in completion metadata functions.

We use these packages because they use Emacs native functions. Unlike
Ivy or Helm.  One alternative is ivy and counsel, check out the
[[https://github.com/MiniApollo/kickstart.emacs/wiki][project wiki]] for more information.

#+begin_src emacs-lisp
  (use-package vertico
    :hook (after-init . vertico-mode)
    ;; Vim keybinds
    ;; :bind (:map vertico-map
    ;;            ("C-j" . vertico-next)
    ;;            ("C-k" . vertico-previous)
    ;;            ("C-u" . vertico-scroll-down)
    ;;            ("C-d" . vertico-scroll-up))
    :custom
    (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
    )

  (savehist-mode) ;; Enables save history mode

  (use-package marginalia
    :after vertico
    :config
    (marginalia-mode))

  (use-package nerd-icons-completion
    :after marginalia
    :config
    (nerd-icons-completion-mode)
    :hook
    (marginalia-mode . nerd-icons-completion-marginalia-setup))
#+end_src

** Completion (Corfu + Cape + Orderless)
*** Corfu
Enhances in-buffer completion with a small completion popup.
Corfu is a small package, which relies on the Emacs completion facilities and concentrates on providing a polished completion.
For more configuration options check out their [[https://github.com/minad/corfu][git repository]].
Notes:
- To enter Orderless field separator, use M-SPC.
#+begin_src emacs-lisp
  (use-package corfu
    ;; Optional customizations
    :custom
    (corfu-cycle t)                ;; Enable cycling for `corfu-next/previous'
    (corfu-auto nil)                 ;; Enable auto completion
    (corfu-auto-prefix 2)          ;; Minimum length of prefix for auto completion.
    (corfu-popupinfo-mode t)       ;; Enable popup information
    (corfu-popupinfo-delay 0.5)    ;; Lower popup info delay to 0.5 seconds from 2 seconds
    (corfu-separator ?\s)          ;; Orderless field separator, Use M-SPC to enter separator
    ;; (corfu-quit-at-boundary nil)   ;; Never quit at completion boundary
    ;; (corfu-quit-no-match nil)      ;; Never quit, even if there is no match
    ;; (corfu-preview-current nil)    ;; Disable current candidate preview
    ;; (corfu-preselect 'prompt)      ;; Preselect the prompt
    ;; (corfu-on-exact-match nil)     ;; Configure handling of exact matches
    ;; (corfu-scroll-margin 5)        ;; Use scroll margin
    (completion-ignore-case t)

    ;; Emacs 30 and newer: Disable Ispell completion function.
    ;; Try `cape-dict' as an alternative.
    (text-mode-ispell-word-completion nil)

    ;; Enable indentation+completion using the TAB key.
    ;; `completion-at-point' is often bound to M-TAB.
    (tab-always-indent 'complete)

    (corfu-preview-current nil) ;; Don't insert completion without confirmation
    ;; Recommended: Enable Corfu globally.  This is recommended since Dabbrev can
    ;; be used globally (M-/).  See also the customization variable
    ;; `global-corfu-modes' to exclude certain modes.
    :init
    (global-corfu-mode)
    :bind (
        :map corfu-map
            ("RET" . nil)
            ("<return>" . nil)
            ([remap keyboard-escape-quit] . nil)
            ("ESC" . corfu-quit)
            ("<escape>" . corfu-quit)))

  (use-package nerd-icons-corfu
    :after corfu
    :init (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))
#+end_src

*** Cape
Provides Completion At Point Extensions which can be used in combination with Corfu, Company or the default completion UI.

We merge capfs together so they appear together in the completion list.
The ones not merged will display separately (Only their list will show up in the completion list).
Order matters. Since these functions run in sequence, the first one to return a list will prevent others from running.
Due to technical details, not all Capfs can be merged successfully (e.g cape-file).

Notes:
- Be aware when adding Capfs (Completion-at-point-functions) to the list since each of the Capfs adds a small runtime cost.
Read the [[https://github.com/minad/cape#configuration][configuration section]] in Cape's readme for more information.
#+begin_src emacs-lisp
  (use-package yasnippet-capf :defer)

  (defun start/setup-capfs ()
    "Configure completion backends"
    ;; Take care when adding Capfs to the list since each of the Capfs adds a small runtime cost.
    (let ((merge-backends (list
                           #'cape-keyword      ;; Keyword completion
                           ;; #'cape-abbrev       ;; Complete abbreviation
                           #'cape-dabbrev      ;; Complete word from current buffers
                           ;; #'cape-line         ;; Complete entire line from current buffer
                           ;; #'cape-history      ;; Complete from Eshell, Comint or minibuffer history
                           ;; #'cape-dict         ;; Dictionary completion (Needs Dictionary file installed)
                           ;; #'cape-tex          ;; Complete Unicode char from TeX command, e.g. \hbar
                           ;; #'cape-sgml         ;; Complete Unicode char from SGML entity, e.g., &alpha
                           ;; #'cape-rfc1345      ;; Complete Unicode char using RFC 1345 mnemonics
                           ;; #'snippy-capf       ;; Vscode Snippets (Snippy needs to be installed)
                           #'yasnippet-capf    ;; Yasnippet snippets
                           ))
          (seperate-backends (list
                              #'cape-file ;; Path completion
                              #'cape-elisp-block ;; Complete elisp in Org or Markdown mode
                              )))
      ;; Remove keyword completion in git commits
      (when (derived-mode-p 'git-commit-mode)
        (setq merge-backends (remq #'cape-keyword merge-backends)))

      ;; Add Elisp symbols only in Elisp modes
      (when (derived-mode-p 'emacs-lisp-mode 'ielm-mode)
        (setq merge-backends (cons #'cape-elisp-symbol merge-backends))) ;; Emacs Lisp code (functions, variables)

      ;; Add Eglot to the front of the list if it's active
      (when (bound-and-true-p eglot--managed-mode)
        (setq merge-backends (cons #'eglot-completion-at-point
   merge-backends)))

      ;; Create the super-capf and set it buffer-locally
      (setq-local completion-at-point-functions
                  (append
                   seperate-backends
                   (list (apply #'cape-capf-super merge-backends)))
                  )))

  (use-package cape
    :after (corfu)
    :init
    ;; Add to the global default value of `completion-at-point-functions' which is
    ;; used by `completion-at-point'.  The order of the functions matters, the
    ;; first function returning a result wins.  Note that the list of buffer-local
    ;; completion functions takes precedence over the global list.

    ;; Seperate function needed, because we use setq-local (everything is replaced)
    (add-hook 'eglot-managed-mode-hook #'start/setup-capfs)
    (add-hook 'prog-mode-hook #'start/setup-capfs)
    (add-hook 'text-mode-hook #'start/setup-capfs))
#+end_src

*** Orderless
Completion style that divides the pattern into space-separated
components and matches candidates that match all of the components in
any order.  Recommended for packages like vertico, corfu.
#+begin_src emacs-lisp
    (use-package orderless
      :defer
      :custom
      (completion-styles '(orderless basic))
      (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src
** Eat (Emulate A Terminal)
Eat is a terminal emulator within Emacs.
It's more portable and less overhead for users over like vterm or eshell.
We setup eat with eshell, if you want to use bash, zsh etc., check out their git [[https://codeberg.org/akib/emacs-eat][repository]] how to do it.

If you want a faster and more responsive terminal emulator try out vterm.
#+begin_src emacs-lisp
    (use-package eat
      :defer
      :hook ('eshell-load-hook #'eat-eshell-mode))
#+end_src

*** Exec-path-from-shell
Make Emacs use the $PATH set up by the user's shell
#+begin_src emacs-lisp
    (use-package exec-path-from-shell
      :hook (after-init . exec-path-from-shell-initialize))
#+end_src
** Version Control (Magit + Diff-hl)
*** Magit
Complete text-based user interface to Git.
#+begin_src emacs-lisp
  (use-package transient
    :defer
    :config
    (define-key transient-map (kbd "<escape>") 'transient-quit-one)) ;; Make escape quit magit prompts

  (use-package magit
    :defer
    :custom (magit-diff-refine-hunk (quote all)) ;; Shows inline diff
    :config
    (setopt magit-format-file-function #'magit-format-file-nerd-icons) ;; Magit nerd icons
    )
*** Diff-hl
Highlights uncommitted changes on the left side of the window (area also known as the "gutter"), allows you to jump between and revert them selectively.
#+begin_src emacs-lisp
    (use-package diff-hl
      :hook ((dired-mode         . diff-hl-dired-mode-unless-remote)
             (magit-post-refresh . diff-hl-magit-post-refresh)
             (after-init . global-diff-hl-mode)))
#+end_src
*** Ediff
#+begin_src emacs-lisp
  (use-package ediff
    :ensure nil
    :custom
    (ediff-keep-variants nil)
    (ediff-split-window-function 'split-window-horizontally)
    (ediff-window-setup-function 'ediff-setup-windows-plain))
#+end_src
** Miscellaneous (undos todos & generally prettify)
*** Recent files
Track recently opened, written and killed buffers.
#+begin_src emacs-lisp
  (use-package recentf
    :config
    (recentf-mode t)
    :custom
    (recentf-max-saved-items 50)
    :bind
    (("C-c w r" . recentf-open)))
#+end_src
