init.org
*** Undo
Undotree like setup.

Undo Fu: Simple, stable linear undo with redo for Emacs.
Undo-fu-session: Persistent undo history
Vundo: Visualizes undo history.


If you want to use this. Don't forget to add keybindings for undu-fu and vundo.
Evil users don't need to add keybindings for undo-fu just change evil-undo-system to undo-fu.

#+begin_src emacs-lisp
  (use-package undo-fu
    :defer
    :config
    ;; Increase undo history limits to reduce likelihood of data loss
    (setq undo-limit (* 1024 1024 64)          ;; 64mb  (default is 160kb)
          undo-strong-limit (* 1024 1024 96)   ;; 96mb  (default is 240kb)
          undo-outer-limit (* 1024 1024 960))) ;; 960mb (default is 24mb)

  (use-package undo-fu-session
    :hook (after-init . undo-fu-session-global-mode)
    :custom (undo-fu-session-incompatible-files '("\\.gpg$" "/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'"))
    :config
    (when (executable-find "zstd")
      ;; There are other algorithms available, but zstd is the fastest, and speed
      ;; is our priority within Emacs
      (setq undo-fu-session-compression 'zst)))

  (use-package vundo
    :defer
    :custom
    (vundo-glyph-alist vundo-unicode-symbols)
    (vundo-compact-display t)
    (add-hook 'vundo-mode-hook (lambda () (visual-line-mode -1))))
#+end_src
*** Hl-todo
Highlight TODO keywords.
#+begin_src emacs-lisp
  (use-package hl-todo
    :hook
    ((prog-mode yaml-ts-mode) . hl-todo-mode)
    :config
    ;; From doom emacs
    (setq hl-todo-highlight-punctuation ":"
          hl-todo-keyword-faces
          '(;; For reminders to change or add something at a later date.
            ("TODO" warning bold)
            ;; For code (or code paths) that are broken, unimplemented, or slow,
            ;; and may become bigger problems later.
            ("FIXME" error bold)
            ;; For code that needs to be revisited later, either to upstream it,
            ;; improve it, or address non-critical issues.
            ("REVIEW" font-lock-keyword-face bold)
            ;; For code smells where questionable practices are used
            ;; intentionally, and/or is likely to break in a future update.
            ("HACK" font-lock-constant-face bold)
            ;; For sections of code that just gotta go, and will be gone soon.
            ;; Specifically, this means the code is deprecated, not necessarily
            ;; the feature it enables.
            ("DEPRECATED" font-lock-doc-face bold)
            ;; Extra keywords commonly found in the wild, whose meaning may vary
            ;; from project to project.
            ("NOTE" success bold)
            ("BUG" error bold)
            ("XXX" font-lock-constant-face bold)))
    )
#+end_src

*** Rainbow Delimiters
Adds colors to brackets.
#+begin_src emacs-lisp
    (use-package rainbow-delimiters
      :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** Ws-butler
Removes whitespace from the ends of lines.
#+begin_src emacs-lisp
    (use-package ws-butler
      :hook (after-init . ws-butler-global-mode))
#+end_src

*** Bookmarks
Bookmark delete bind.
#+begin_src emacs-lisp
  (use-package bookmark
    :custom
    (bookmark-save-flag 1)
    :bind
    ("C-x r d" . bookmark-delete))
#+end_src

** Consult
Provides search and navigation commands based on the Emacs completion function.
Telescope for Emacs.
Check out their [[https://github.com/minad/consult][git repository]] for more awesome functions.
#+begin_src emacs-lisp
  (use-package consult
    ;; Enable automatic preview at point in the *Completions* buffer. This is
    ;; relevant when you use the default completion UI.
    :hook (completion-list-mode . consult-preview-at-point-mode)
    :init
    ;; Optionally configure the register formatting. This improves the register
    ;; preview for `consult-register', `consult-register-load',
    ;; `consult-register-store' and the Emacs built-ins.
    (setq register-preview-delay 0.5
          register-preview-function #'consult-register-format)

    ;; Optionally tweak the register preview window.
    ;; This adds thin lines, sorting and hides the mode line of the window.
    (advice-add #'register-preview :override #'consult-register-window)

    ;; Use Consult to select xref locations with preview
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)
    :config
    ;; Optionally configure preview. The default value
    ;; is 'any, such that any key triggers the preview.
    ;; (setq consult-preview-key 'any)
    ;; (setq consult-preview-key "M-.")
    ;; (setq consult-preview-key '("S-<down>" "S-<up>"))

    ;; For some commands and buffer sources it is useful to configure the
    ;; :preview-key on a per-command basis using the `consult-customize' macro.
    ;; (consult-customize
    ;; consult-theme :preview-key '(:debounce 0.2 any)
    ;; consult-ripgrep consult-git-grep consult-grep
    ;; consult-bookmark consult-recent-file consult-xref
    ;; consult--source-bookmark consult--source-file-register
    ;; consult--source-recent-file consult--source-project-recent-file
    ;; :preview-key "M-."
    ;; :preview-key '(:debounce 0.4 any))

    ;; By default `consult-project-function' uses `project-root' from project.el.
    ;; Optionally configure a different project root function.
     ;;;; 1. project.el (the default)
    ;; (setq consult-project-function #'consult--default-project--function)
     ;;;; 2. vc.el (vc-root-dir)
    ;; (setq consult-project-function (lambda (_) (vc-root-dir)))
     ;;;; 3. locate-dominating-file
    ;; (setq consult-project-function (lambda (_) (locate-dominating-file "." ".git")))
     ;;;; 4. projectile.el (projectile-project-root)
    (autoload 'projectile-project-root "projectile")
    (setq consult-project-function (lambda (_) (projectile-project-root)))
     ;;;; 5. No project support
    ;; (setq consult-project-function nil)
    )
#+end_src

* File management & opening
** Dired
Directory Editor of Emacs.
#+begin_src emacs-lisp
  (use-package dired
    :ensure
    nil
    :commands
    (dired dired-jump)
    :custom
    (dired-listing-switches
     "-goah --group-directories-first --time-style=long-iso")
    (dired-listing-switches "-lth")
    (dired-dwim-target t)
    (delete-by-moving-to-trash t)
    :init
    (put 'dired-find-alternate-file 'disabled nil))

  ;; Hide or display hidden files

  (use-package dired
    :ensure nil
    :hook
    (dired-mode . dired-omit-mode)
    (dired-mode . dired-hide-details-mode)
    :bind (:map dired-mode-map
                ( "."     . dired-omit-mode))
    :custom (dired-omit-files "^\\.[a-zA-Z0-9]+"))

  ;; Backup files

  (setq-default backup-directory-alist
                `(("." . ,(expand-file-name "backups/" user-emacs-directory)))
                version-control t
                delete-old-versions t
                create-lockfiles nil)
#+end_src
** Viewing files (& externally)
Packages for comsumption without leaving emacs.
*** pdf-tools
Advanced reader and more.
#+begin_src emacs-lisp
  (use-package pdf-tools
    :mode ("\\.pdf\\'" . pdf-view-mode)
    :config
    (pdf-tools-install)
    (require 'pdf-roll nil t)
    :custom
    (pdf-view-display-size 'fit-page)
    (pdf-view-use-scaling t)
    (pdf-view-midnight-colors '("#ffffff" . "#1e1e1e")))
#+end_src
*** nov.el (epub)
Read ePub files
#+begin_src emacs-lisp
  (use-package nov
    :init
    (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))
#+end_src
*** elfeed (rss feed reader)
Read RSS feeds with Elfeed
#+begin_src emacs-lisp
  (use-package elfeed
    :custom
    (elfeed-db-directory
     (expand-file-name "elfeed" user-emacs-directory))
    (elfeed-show-entry-switch 'display-buffer)
    :bind
    ("C-c w e" . elfeed))

  ;; Configure Elfeed with org mode

  (use-package elfeed-org
    :config
    (elfeed-org)
    :custom
    (rmh-elfeed-org-files
     (list (concat (file-name-as-directory (getenv "HOME"))
  		 "elfeed.org"))))
#+end_src
*** images (gimp)
Image viewer
#+begin_src emacs-lisp
  (use-package emacs
    :custom
    (image-dired-external-viewer "gimp")
    :bind
    ((:map image-mode-map
           ("k" . image-kill-buffer)
           ("<right>" . image-next-file)
           ("<left>"  . image-previous-file))
     (:map dired-mode-map
           ("C-<return>" . image-dired-dired-display-external))))

  (use-package image-dired
    :bind
    (("C-c w I" . image-dired))
    (:map image-dired-thumbnail-mode-map
          ("C-<right>" . image-dired-display-next)
          ("C-<left>"  . image-dired-display-previous)))
#+end_src
