init.org
*** emms (Music)
Emacs Multimedia System
#+begin_src emacs-lisp
  (use-package emms
    :config
    (require 'emms-setup)
    (require 'emms-mpris)
    (emms-all)
    (emms-default-players)
    (emms-mpris-enable)
    :custom
    (emms-browser-covers #'emms-browser-cache-thumbnail-async)
    :bind
    (("C-c w m b" . emms-browser)
     ("C-c w m e" . emms)
     ("C-c w m p" . emms-play-playlist )
     ("<XF86AudioPrev>" . emms-previous)
     ("<XF86AudioNext>" . emms-next)
     ("<XF86AudioPlay>" . emms-pause)))
#+end_src

*** dired-x (Open externally)
Generic file opening with system applications directly from Dired. Use
'&' (dired-do-async-shell-command) on a file to trigger these rules.
#+begin_src emacs-lisp
  (use-package dired-x
    :ensure nil
    :custom
    (dired-guess-shell-alist-user
     '(("\\.\\(png\\|jpe?g\\|tiff\\|gif\\|webp\\)\\'" "feh")
       ("\\.\\(mp[34]\\|m4a\\|ogg\\|flac\\|webm\\|mkv\\)\\'" "mpv")
       (".*" "xdg-open"))))
#+end_src

* Writing
Emacs contains many “editing modes” that alter its basic behavior in
useful ways. These are divided into “major modes” and “minor modes”.
For more: C-h i: g: (emacs)Modes

Some programming languages require the installation of specific modes
to fully integrate and function within Emacs. These packages are often
necessary for features like syntax highlighting, code formatting,
linting, and language-specific features.

Example, how to setup a language mode. Use C-SPC tab to uncomment the
lines. *To use it, remove :tangle no from the beginning of the source
code block.*
#+begin_src emacs-lisp :tangle no
  (use-package lua-mode
    :mode "\\.lua\\'") ;; Only start in a lua file
#+end_src

** Org Mode
One of the things that Emacs is loved for.  Once you've used it for a
bit, you'll understand why people love it. Even reading about it can
be inspiring!  For example, this document is effectively the source
code and descriptions bound into the one document, much like the
literate programming ideas that Donald Knuth made famous.

We use an Org mode document for our Emacs configuration because it
provides:
- Better organization:  It lets us structure  with outlines, headings,
  and tags.
- Literate Documentation: It's a document, not just source code.
- Fast Navigation: Quickly jump to sections with something like Imenu.

If you consider using org mode even more. Check out the [[https://github.com/minad/org-modern][org-modern]] package.
It makes org mode really beautiful.
Don't forget to remove org-superstar if you want to use it.

For templates use C-c C-,
Much easier than org-tempo
#+begin_src emacs-lisp
  (use-package org
    :ensure nil
    :custom
    ;; (org-edit-src-content-indentation 4) ;; Set src block automatic indent to 4 instead of 2.
    (org-return-follows-link t)   ;; Sets RETURN key in org-mode to follow links
    (org-hide-emphasis-markers t)
    (org-startup-with-inline-images t)
    (org-image-actual-width '(450))
    (org-pretty-entities t)
    ;; (org-use-sub-superscripts "{}")
    (org-id-link-to-org-use-id t)
    (org-fold-catch-invisible-edits 'show)
    (org-agenda-custom-commands
     '(("e" "Agenda, next actions and waiting"
        ((agenda "" ((org-agenda-overriding-header "Next three days:")
                     (org-agenda-span 3)
                     (org-agenda-start-on-weekday nil)))
         (todo "NEXT" ((org-agenda-overriding-header "Next Actions:")))
         (todo "WAIT" ((org-agenda-overriding-header "Waiting:")))))))
  :bind
  (("C-c a" . org-agenda)))
#+end_src

**** Table of Contents
#+begin_src emacs-lisp
    (use-package toc-org
      :commands toc-org-enable
      :hook (org-mode . toc-org-mode))
#+end_src

**** Org Superstar
Prettify headings and plain lists in Org mode. Modern version of org-bullets.
#+begin_src emacs-lisp
    (use-package org-superstar
      :after org
      :hook (org-mode . org-superstar-mode))
#+end_src

**** Org Appear
Invisible elements visible under cursor position.
#+begin_src emacs-lisp
  (use-package org-appear
    :hook
    (org-mode . org-appear-mode))
#+end_src

**** Org insert hyperlink
#+begin_src emacs-lisp
  (use-package org-web-tools
    :bind
    (("C-c w w" . org-web-tools-insert-link-for-url)))
#+end_src

** text mode
#+begin_src emacs-lisp
  (use-package text-mode
    :ensure
    nil
    :hook
    (text-mode . visual-line-mode)
    :custom
    (sentence-end-double-space nil)
    (scroll-error-top-bottom t)
    (save-interprogram-paste-before-kill t))
#+end_src

** Emacs writing studio variables autoload & executables check
Custom variables autoload.
#+begin_src emacs-lisp
  (load-file (concat (file-name-as-directory user-emacs-directory)
                     "ews.el"))
  (ews-missing-executables
   '(("gs" "mutool")
     "pdftotext"
     "soffice"
     "zip"
     "ddjvu"
     "curl"
     ("mpg321" "ogg123" "mplayer" "mpv" "vlc")
     ("grep" "ripgrep")
     ("convert" "gm")
     "dvipng"
     "latex"
     "hunspell"
     "git"))
#+end_src

** Notetaking (org + denote + consult)
Fleeting notes configuration.
#+begin_src emacs-lisp
    (use-package org
      :bind
      (("C-c c" . org-capture)
       ("C-c l" . org-store-link))
      :custom
      (org-capture-templates
       '(("f" "Fleeting note"
          item
          (file+headline org-default-notes-file "Notes")
          "- %?")
         ("p" "Permanent note" plain
          (file denote-last-path)
          #'denote-org-capture
          :no-save t
          :immediate-finish nil
          :kill-buffer t
          :jump-to-captured t)
         ("t" "New task" entry
          (file+headline org-default-notes-file "Tasks")
          "* TODO %i%?"))))

    ;; Denote

    (use-package denote
      :defer t
      :custom
      (denote-sort-keywords t)
      (denote-link-description-function #'ews-denote-link-description-title-case)
      (denote-rename-buffer-mode 1)
      :hook
      (dired-mode . denote-dired-mode)
      :custom-face
      (denote-faces-link ((t (:slant italic))))
      :bind
      (("C-c w d b" . denote-find-backlink)
       ("C-c w d d" . denote-date)
       ("C-c w d l" . denote-find-link)
       ("C-c w d i" . denote-link-or-create)
       ("C-c w d k" . denote-rename-file-keywords)
       ("C-c w d n" . denote)
       ("C-c w d r" . denote-rename-file)
       ("C-c w d R" . denote-rename-file-using-front-matter)))

    ;; Denote auxiliary packages

    (use-package denote-journal)

    (use-package denote-org
      :bind
      (("C-c w d h" . denote-org-link-to-heading)))

    (use-package denote-sequence)

    ;; Consult convenience functions
    (use-package consult
      :bind
      (("C-c w h" . consult-org-heading)
       ("C-c w g" . consult-ripgrep)
       ("C-c w G" . baej-consult-ripgrep-docs) ;; described in custom functions
       ("C-c w F" . baej-consult-fd-docs) ;; described in custom functions
       ("C-c w f" . consult-fd))
      :config
      (add-to-list 'consult-preview-allowed-hooks 'visual-line-mode))

    ;; Consult-Notes for easy access to notes

    (use-package consult-notes
      :custom
      (consult-notes-denote-display-keywords-indicator "_")
      :bind
      (("C-c w d f" . consult-notes)
       ("C-c w d g" . consult-notes-search-in-all-notes))
      :init
      (consult-notes-denote-mode))

    ;; Citar-Denote to manage literature notes

    (use-package citar-denote
      :custom
      (citar-open-always-create-notes t)
      (citar-denote-subdir "literature")
      :init
      (citar-denote-mode)
      :bind
      (("C-c w b c" . citar-create-note)    ;; Create a bibliographic note
       ("C-c w b n" . citar-denote-open-note)
       ("C-c w b x" . citar-denote-nocite)
       :map org-mode-map
       ("C-c w b k" . citar-denote-add-citekey)
       ("C-c w b K" . citar-denote-remove-citekey)
       ("C-c w b d" . citar-denote-dwim)
       ("C-c w b e" . citar-denote-open-reference-entry)))

    ;; Explore and manage your Denote collection

    (use-package denote-explore
      :bind
      (;; Statistics
       ("C-c w x c" . denote-explore-count-notes)
       ("C-c w x C" . denote-explore-count-keywords)
       ("C-c w x b" . denote-explore-barchart-keywords)
       ("C-c w x e" . denote-explore-barchart-filetypes)
       ;; Random walks
       ("C-c w x r" . denote-explore-random-note)
       ("C-c w x l" . denote-explore-random-link)
       ("C-c w x k" . denote-explore-random-keyword)
       ("C-c w x x" . denote-explore-random-regex)
       ;; Denote Janitor
       ("C-c w x d" . denote-explore-identify-duplicate-notes)
       ("C-c w x z" . denote-explore-zero-keywords)
       ("C-c w x s" . denote-explore-single-keywords)
       ("C-c w x o" . denote-explore-sort-keywords)
       ("C-c w x w" . denote-explore-rename-keyword)
       ;; Visualise denote
       ("C-c w x n" . denote-explore-network)
       ("C-c w x v" . denote-explore-network-regenerate)
       ("C-c w x D" . denote-explore-barchart-degree)))

    ;; Set some Org mode shortcuts

    (use-package org
      :bind
      (:map org-mode-map
            ("C-c w n" . ews-org-insert-notes-drawer)
            ("C-c w p" . ews-org-insert-screenshot)
            ("C-c w c" . ews-org-count-words)))
#+end_src

*** Lorem ipsum insert
#+begin_src emacs-lisp
(use-package lorem-ipsum
    :custom
    (lorem-ipsum-list-bullet "- ") ;; Org mode bullets
    :init
    (setq lorem-ipsum-sentence-separator
          (if sentence-end-double-space "  " " "))
    :bind
    (("C-c w i" . lorem-ipsum-insert-paragraphs)))
#+end_src

** Bibliography
Biblio package for looking up doi and arXiv paper metadata.
#+begin_src emacs-lisp
  (use-package biblio
    :bind
    (("C-c w b b" . ews-bibtex-biblio-lookup)))
#+end_src

