init.org
*** Bibtex
Bibtex for editing the `.bib` file.
#+begin_src emacs-lisp
    (use-package bibtex
      :custom
      (bibtex-autokey-names 1)
      (bibtex-autokey-year-length 2)
      (bibtex-autokey-titlewords 0)

      (bibtex-autokey-name-year-separator "")
      (bibtex-autokey-year-title-separator "")
      (bibtex-autokey-titleword-separator "")

      (bibtex-autokey-name-change-strings
       '(("ą" . "a") ("ć" . "c") ("ę" . "e") ("ł" . "l") ("ń" . "n")
         ("ó" . "o") ("ś" . "s") ("ż" . "z") ("ź" . "z")
         ("Ą" . "A") ("Ć" . "C") ("Ę" . "E") ("Ł" . "L") ("Ń" . "N")
         ("Ó" . "O") ("Ś" . "S") ("Ż" . "Z") ("Ź" . "Z")))
      (bibtex-user-optional-fields
       '(("keywords" "Keywords to describe the entry" "")
         ("file"     "Relative or absolute path to attachments" "" )))
      (bibtex-align-at-equal-sign t)
      :config
      (ews-bibtex-register)
      :bind
      (("C-c w b r" . ews-bibtex-register))
      :hook
      (bibtex-mode . (lambda () (setq-local completion-at-point-functions nil))))
#+end_src

*** Citar package
#+begin_src emacs-lisp
  ;; Citar to access bibliographies

  (use-package citar
    :defer t
    :custom
    (citar-bibliography ews-bibtex-files)
    :bind
    (("C-c w b o" . citar-open)))
#+end_src

** Spell check (Sideline-flymake)
Show flymake errors with sideline.
#+begin_src emacs-lisp
    (use-package sideline-flymake
      :hook (flymake-mode . sideline-mode)
      :custom
      (sideline-flymake-display-mode 'line) ;; Show errors on the current line
      (sideline-backends-right '(sideline-flymake)))
#+end_src
** Export
Exporting citations with Org Mode.
#+begin_src emacs-lisp
  (require 'oc-natbib)
  (require 'oc-csl)

  (setq org-cite-global-bibliography ews-bibtex-files
        org-cite-insert-processor 'citar
        org-cite-follow-processor 'citar
        org-cite-activate-processor 'citar)

  (use-package org
    :custom
    (org-export-with-drawers nil)
    (org-export-with-todo-keywords nil)
    (org-export-with-toc nil)
    (org-export-with-smart-quotes t)
    (org-export-date-timestamp-format "%e %B %Y"))

  (use-package ox-epub
    :demand t
    :init
    (require 'ox-org))
  (use-package ox-latex
    :ensure nil
    :demand t
    :custom
    ;; Multiple LaTeX passes for bibliographies
    (org-latex-pdf-process
     '("pdflatex -interaction nonstopmode -output-directory %o %f"
       "bibtex %b"
       "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
       "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
    ;; Clean temporary files after export
    (org-latex-logfiles-extensions
     (quote ("lof" "lot" "tex~" "aux" "idx" "log" "out"
             "toc" "nav" "snm" "vrb" "dvi" "fdb_latexmk"
             "blg" "brf" "fls" "entoc" "ps" "spl" "bbl"
             "tex" "bcf"))))

  (with-eval-after-load 'ox-latex
    (add-to-list
     'org-latex-classes
     '("ews"
       "\\documentclass[11pt, twoside, hidelinks]{memoir}
          \\setstocksize{9.25in}{7.5in}
          \\settrimmedsize{\\stockheight}{\\stockwidth}{*}
          \\setlrmarginsandblock{1.5in}{1in}{*}
          \\setulmarginsandblock{1in}{1.5in}{*}
          \\checkandfixthelayout
          \\layout
          \\setcounter{tocdepth}{0}
          \\renewcommand{\\baselinestretch}{1.25}
          \\setheadfoot{0.5in}{0.75in}
          \\setlength{\\footskip}{0.8in}
          \\chapterstyle{bianchi}
          \\setsecheadstyle{\\normalfont \\raggedright \\textbf}
          \\setsubsecheadstyle{\\normalfont \\raggedright \\emph}
          \\setsubsubsecheadstyle{\\normalfont\\centering}
          \\pagestyle{myheadings}
          \\usepackage[font={small, it}]{caption}
          \\usepackage{ccicons}
          \\usepackage{ebgaramond}
          \\usepackage[authoryear]{natbib}
          \\bibliographystyle{apalike}
          \\usepackage{svg}
  \\hyphenation{mini-buffer}"
       ("\\chapter{%s}" . "\\chapter*{%s}")
       ("\\section{%s}" . "\\section*{%s}")
       ("\\subsection{%s}" . "\\subsection*{%s}")
       ("\\subsubsection{%s}" . "\\subsubsection*{%s}"))))
#+end_src

* Trying out - packages
All the package setups that don't need much tweaking.
** Embark
Emacs Mini-Buffer Actions Rooted in Keymaps. Right click like menu for Emacs.
#+begin_src emacs-lisp :tangle no
    (use-package embark :defer)
    (use-package embark-consult
      :hook
      (embark-collect-mode . consult-preview-at-point-mode))
#+end_src
* Coding
** Projectile
Project interaction library for Emacs.

Emacs has a built in project manager called project.el, but we don't use it.
You can try it out with the keybinds under C-x p because project.el does not require any special setup to use.

We use projectile because it:
- supports more features and project types.
- has better integration with projects.
- has better documentation.
- is developed faster.
More [[https://docs.projectile.mx/projectile/projectile_vs_project.html][reasons]] to use projectile.

You can also make the [[https://github.com/karthink/consult-dir][consult-dir]] package list all the directories you [[https://github.com/MiniApollo/config/blob/main/emacs/init.org#consult-dir][specified]] and search from them like in tmux-sessionizer.
#+begin_src emacs-lisp
    (use-package projectile
      :hook (after-init . projectile-mode)
      :config
      (projectile-mode)
      :custom
      ;; (projectile-auto-discover nil) ;; Disable auto search for better startup times ;; Search with a keybind
      (projectile-run-use-comint-mode t) ;; Interactive run dialog when running projects inside emacs (like giving input)
      (projectile-switch-project-action #'projectile-dired) ;; Open dired when switching to a project
      (projectile-project-search-path '("~/org/org-roam" "~/Projekty/" ("~/github" . 1)))) ;; . 1 means only search the first subdirectory level for projects
#+end_src
** LSP (Eglot + Mason)
*** Eglot
Built in Emacs client for the Language Server Protocol.  We use Eglot
because it is fast and minimal.  For more: C-h i: g: (eglot)Top

Eglot does not automatically download LSP servers. It requires
separate download.  The easiest way to install LSP servers is with a
package manager like mason.el.

If you can't use a package manager you can do the following:
- Download the server (e.g. from github)
- Add the binary/executable to your path.
- Or customize the eglot-server-programs list.
To control how a LSP server is started customize the
eglot-server-programs list.

There are many alternative LSP clients, one of them is LSP-mode.
Which has more features and supports automatic language server
installation.  But it's bigger, so it has more moving parts.

We don't use it because Eglot is more than enough for most people.
If you want to use LSP mode check out their [[https://emacs-lsp.github.io/lsp-mode/][documentation]] or the [[https://github.com/MiniApollo/kickstart.emacs/wiki][project wiki]] page for more information.
#+begin_src emacs-lisp :tangle no
    (use-package eglot
      :ensure nil ;; Don't install eglot because it's now built-in
      :hook ((c-mode c++-mode ;; Autostart lsp servers for a given mode
                     lua-mode) ;; Lua-mode needs to be installed
             . eglot-ensure)
      :custom
      ;; Good default
      (eglot-events-buffer-size 0) ;; No event buffers (LSP server logs)
      (eglot-autoshutdown t);; Shutdown unused servers.
      (eglot-report-progress nil) ;; Disable LSP server logs (Don't show lsp messages at the bottom, java)
      ;; Manual lsp servers
      ;;:config
      ;;(add-to-list 'eglot-server-programs
      ;;             `(lua-mode . ("PATH_TO_THE_LSP_FOLDER/bin/lua-language-server" "-lsp"))) ;; Adds our lua lsp server to eglot's server list
      )
#+end_src

*** Mason.el
Package manager for LSP, DAP, linters, and more for the Emacs Operating System.
I waited so long for a package like this.
If you plan to use something like LSP-mode don't forget to remove this.
#+begin_src emacs-lisp
    (use-package mason
      :hook (after-init . mason-ensure))
#+end_src

** Tree-Sitter
A parser generator tool and an incremental parsing library.
Check out TJ's [[https://www.youtube.com/watch?v=09-9LltqWLY][video]] to learn why you should use it.

With Emacs 29 Tree-Sitter is now built-in. You may need to compile Emacs from source to have it enabled.
You also need to have a compiler installed so Emacs can compile the parsers into a shared library.
For more info about how to use Tree-Sitter check out this [[https://www.masteringemacs.org/article/how-to-get-started-tree-sitter][masteringemacs]] article.

Using Tree-Sitter is somewhat hacky because it requires you to:
- manually manage a source list of the parsers you want to use.
- remap the major modes you want to use.
You can also use treesit-auto, but it is updated quite slowly so we don't use it.

To explore the current buffer's syntax tree, use the treesit-explore-mode command.

*To use it, remove :tangle no from the beginning of the source code block.*
#+begin_src emacs-lisp :tangle no
    (setq treesit-language-source-alist
          '((bash "https://github.com/tree-sitter/tree-sitter-bash")
            (cmake "https://github.com/uyha/tree-sitter-cmake")
            (c "https://github.com/tree-sitter/tree-sitter-c")
            (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
            (css "https://github.com/tree-sitter/tree-sitter-css")
            (elisp "https://github.com/Wilfred/tree-sitter-elisp")
            (gdscript "https://github.com/PrestonKnopp/tree-sitter-gdscript")
            (go "https://github.com/tree-sitter/tree-sitter-go")
            (gomod "https://github.com/camdencheek/tree-sitter-go-mod")
            (html "https://github.com/tree-sitter/tree-sitter-html")
            (hyprlang "https://github.com/tree-sitter-grammars/tree-sitter-hyprlang")
            (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
            (json "https://github.com/tree-sitter/tree-sitter-json")
            (make "https://github.com/alemuller/tree-sitter-make")
            (markdown "https://github.com/ikatyang/tree-sitter-markdown")
            (python "https://github.com/tree-sitter/tree-sitter-python")
            (rust "https://github.com/tree-sitter/tree-sitter-rust")
            (toml "https://github.com/tree-sitter/tree-sitter-toml")
            (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
            (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
            (vue "https://github.com/ikatyang/tree-sitter-vue")
            (yaml "https://github.com/ikatyang/tree-sitter-yaml")))

    (defun start/install-treesit-grammars ()
      "Install missing treesitter grammars"
      (interactive)
      (dolist (grammar treesit-language-source-alist)
        (let ((lang (car grammar)))
          (unless (treesit-language-available-p lang)
            (treesit-install-language-grammar lang)))))

    ;; Call this function to install missing grammars
    (add-hook 'after-init-hook #'start/install-treesit-grammars)

    ;; Optionally, add any additional mode remappings not covered by defaults
    (setq major-mode-remap-alist
          '((yaml-mode . yaml-ts-mode)
            (sh-mode . bash-ts-mode)
            (c-mode . c-ts-mode)
            (c++-mode . c++-ts-mode)
            (css-mode . css-ts-mode)
            (python-mode . python-ts-mode)
            (mhtml-mode . html-ts-mode)
            (javascript-mode . js-ts-mode)
            (js-json-mode . json-ts-mode)
            (typescript-mode . typescript-ts-mode)
            (conf-toml-mode . toml-ts-mode)
            (gdscript-mode . gdscript-ts-mode)
            ))
    (setq treesit-font-lock-level 3)

    ;; Or if there is no built in mode
    (use-package cmake-ts-mode :ensure nil :mode ("CMakeLists\\.txt\\'" "\\.cmake\\'"))
    (use-package go-mod-ts-mode :ensure nil :mode "\\.mod\\'")
    (use-package lua-ts-mode :ensure nil :mode "\\.lua\\'")
    (use-package rust-ts-mode :ensure nil :mode "\\.rs\\'")
    (use-package typescript-ts-mode :ensure nil :mode "\\.ts\\'")
    (use-package tsx-ts-mode :ensure nil :mode "\\.tsx\\'")
    (use-package yaml-ts-mode :ensure nil :mode ("\\.yaml\\'" "\\.yml\\'"))
#+end_src

